Tekla Open API Reference for Tekla Structures 2025
TransformationPlane Methods
The TransformationPlane type exposes the following members.
Methods
Name | Description
ToString
 Returns a string representation of the matrices that transform to local and global coordinates.
 (Overrides Object.ToString().)
Top
See Also
Reference
TransformationPlane Class
Tekla.Structures.Model Namespace